// 5. Створіть базовий міксін, який додає декілька методів або даних у компонент.

//  6. Створіть міксін, який включає хуки життєвого циклу для логування повідомлень при створенні та знищенні компоненту.

// 7. Створіть глобальний міксін і додайте його глобально в вашому основному файлі main.js або main.ts. 
export const counterMixin = {
    data() {
        return {
            counter: 0
        };
    },
    methods: {
        increment() {
            this.counter++
        },
        decrement() {
            this.counter--
        }
    },
    mounted() {
        this.counter += 10
    }
};